# CalcPolySegLen

## Description
Calculate the length between two segments of a polygon or polyline

```pascal
FUNCTION CalcPolySegLen(
				hPoly : HANDLE;
				i1    : INTEGER;
				i2    : INTEGER) : REAL;
```

```python

def vs.CalcPolySegLen(hPoly, i1, i2):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hPoly|HANDLE||
|i1|INTEGER||
|i2|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation